#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mgoogle_compute_global_address.portfolio: Refreshing state... [id=projects/data-visitor-334805/global/addresses/portfolio][0m
[0m[1mgoogle_dns_managed_zone.portfolio: Refreshing state... [id=projects/data-visitor-334805/managedZones/piper-codes][0m
[0m[1mgoogle_cloud_run_service.portfolio: Refreshing state... [id=locations/us-central1/namespaces/data-visitor-334805/services/portfolio][0m
[0m[1mgoogle_cloud_run_service_iam_policy.portfolio: Refreshing state... [id=v1/projects/data-visitor-334805/locations/us-central1/services/portfolio][0m
[0m[1mgoogle_compute_region_network_endpoint_group.portfolio: Refreshing state... [id=projects/data-visitor-334805/regions/us-central1/networkEndpointGroups/portfolio][0m
[0m[1mgoogle_dns_record_set.portfolio: Refreshing state... [id=projects/data-visitor-334805/managedZones/piper-codes/rrsets/piper.codes./A][0m
[0m[1mgoogle_compute_managed_ssl_certificate.portfolio: Refreshing state... [id=projects/data-visitor-334805/global/sslCertificates/portfolio][0m
[0m[1mgoogle_compute_backend_service.portfolio: Refreshing state... [id=projects/data-visitor-334805/global/backendServices/portfolio][0m
[0m[1mgoogle_compute_url_map.portfolio: Refreshing state... [id=projects/data-visitor-334805/global/urlMaps/portfolio][0m
[0m[1mgoogle_compute_target_https_proxy.portfolio: Refreshing state... [id=projects/data-visitor-334805/global/targetHttpsProxies/portfolio][0m
[0m[1mgoogle_compute_global_forwarding_rule.portfolio: Refreshing state... [id=projects/data-visitor-334805/global/forwardingRules/portfolio][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # google_compute_backend_service.portfolio[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "google_compute_backend_service" "portfolio" {
      [31m-[0m [0m[1m[0maffinity_cookie_ttl_sec[0m[0m         = 0 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mconnection_draining_timeout_sec[0m[0m = 300 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m              = "2021-12-10T22:52:07.516-08:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcustom_request_headers[0m[0m          = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcustom_response_headers[0m[0m         = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0menable_cdn[0m[0m                      = true [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mfingerprint[0m[0m                     = "J_oBh9DiIuQ=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mhealth_checks[0m[0m                   = [] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                              = "projects/data-visitor-334805/global/backendServices/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mload_balancing_scheme[0m[0m           = "EXTERNAL" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                            = "portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mport_name[0m[0m                       = "http" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                         = "data-visitor-334805" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mprotocol[0m[0m                        = "HTTP" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                       = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/backendServices/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msession_affinity[0m[0m                = "NONE" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtimeout_sec[0m[0m                     = 30 [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mbackend {
          [31m-[0m [0m[1m[0mbalancing_mode[0m[0m               = "UTILIZATION" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mcapacity_scaler[0m[0m              = 1 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mgroup[0m[0m                        = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/regions/us-central1/networkEndpointGroups/portfolio" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_connections[0m[0m              = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_connections_per_endpoint[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_connections_per_instance[0m[0m = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_rate[0m[0m                     = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_rate_per_endpoint[0m[0m        = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_rate_per_instance[0m[0m        = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_utilization[0m[0m              = 0 [90m->[0m [0m[90mnull[0m[0m
        }

      [31m-[0m [0mcdn_policy {
          [31m-[0m [0m[1m[0mcache_mode[0m[0m                   = "CACHE_ALL_STATIC" [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mclient_ttl[0m[0m                   = 7200 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mdefault_ttl[0m[0m                  = 3600 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mmax_ttl[0m[0m                      = 10800 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mnegative_caching[0m[0m             = true [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0mserve_while_stale[0m[0m            = 0 [90m->[0m [0m[90mnull[0m[0m
          [31m-[0m [0m[1m[0msigned_url_cache_max_age_sec[0m[0m = 7200 [90m->[0m [0m[90mnull[0m[0m
        }
    }

[1m  # google_compute_global_forwarding_rule.portfolio[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "google_compute_global_forwarding_rule" "portfolio" {
      [31m-[0m [0m[1m[0mid[0m[0m                    = "projects/data-visitor-334805/global/forwardingRules/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mip_address[0m[0m            = "34.117.171.161" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mip_protocol[0m[0m           = "TCP" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mload_balancing_scheme[0m[0m = "EXTERNAL" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                  = "portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mport_range[0m[0m            = "443-443" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m               = "data-visitor-334805" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m             = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/forwardingRules/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtarget[0m[0m                = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/targetHttpsProxies/portfolio" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # google_compute_managed_ssl_certificate.portfolio[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "google_compute_managed_ssl_certificate" "portfolio" {
      [31m-[0m [0m[1m[0mcertificate_id[0m[0m            = 6484025929983719031 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m        = "2021-12-10T22:43:36.348-08:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mexpire_time[0m[0m               = "2022-03-10T22:18:52.000-08:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                        = "projects/data-visitor-334805/global/sslCertificates/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m                      = "portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m                   = "data-visitor-334805" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m                 = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/sslCertificates/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0msubject_alternative_names[0m[0m = [
          [31m-[0m [0m"piper.codes",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mtype[0m[0m                      = "MANAGED" [90m->[0m [0m[90mnull[0m[0m

      [31m-[0m [0mmanaged {
          [31m-[0m [0m[1m[0mdomains[0m[0m = [
              [31m-[0m [0m"piper.codes",
            ] [90m->[0m [0m[90mnull[0m[0m
        }
    }

[1m  # google_compute_target_https_proxy.portfolio[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "google_compute_target_https_proxy" "portfolio" {
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m = "2021-12-10T22:52:40.097-08:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                 = "projects/data-visitor-334805/global/targetHttpsProxies/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m               = "portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m            = "data-visitor-334805" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproxy_bind[0m[0m         = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproxy_id[0m[0m           = 7247679413089334359 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mquic_override[0m[0m      = "NONE" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m          = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/targetHttpsProxies/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mssl_certificates[0m[0m   = [
          [31m-[0m [0m"https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/sslCertificates/portfolio",
        ] [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0murl_map[0m[0m            = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/urlMaps/portfolio" [90m->[0m [0m[90mnull[0m[0m
    }

[1m  # google_compute_url_map.portfolio[0m has been deleted[0m[0m
[0m  [31m-[0m[0m resource "google_compute_url_map" "portfolio" {
      [31m-[0m [0m[1m[0mcreation_timestamp[0m[0m = "2021-12-10T22:52:28.872-08:00" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mdefault_service[0m[0m    = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/backendServices/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mfingerprint[0m[0m        = "DF4BZR9UJOs=" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mid[0m[0m                 = "projects/data-visitor-334805/global/urlMaps/portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mmap_id[0m[0m             = 4747613550344270915 [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mname[0m[0m               = "portfolio" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mproject[0m[0m            = "data-visitor-334805" [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mself_link[0m[0m          = "https://www.googleapis.com/compute/v1/projects/data-visitor-334805/global/urlMaps/portfolio" [90m->[0m [0m[90mnull[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # google_cloud_run_service.portfolio[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "google_cloud_run_service" "portfolio" {
        [1m[0mid[0m[0m                         = "locations/us-central1/namespaces/data-visitor-334805/services/portfolio"
        [1m[0mname[0m[0m                       = "portfolio"
        [90m# (4 unchanged attributes hidden)[0m[0m


      [33m~[0m [0mtemplate {

          [33m~[0m [0mspec {
                [90m# (2 unchanged attributes hidden)[0m[0m

              [33m~[0m [0mcontainers {
                  [33m~[0m [0m[1m[0mimage[0m[0m   = "us-docker.pkg.dev/data-visitor-334805/general/portfolio:335337f" [33m->[0m [0m"us-docker.pkg.dev/data-visitor-334805/general/portfolio:3fb23a6"
                    [90m# (2 unchanged attributes hidden)[0m[0m


                    [90m# (2 unchanged blocks hidden)[0m[0m
                }
            }
            [90m# (1 unchanged block hidden)[0m[0m
        }

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # google_compute_backend_service.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_backend_service" "portfolio" {
      [32m+[0m [0m[1m[0mconnection_draining_timeout_sec[0m[0m = 300
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0menable_cdn[0m[0m                      = true
      [32m+[0m [0m[1m[0mfingerprint[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_scheme[0m[0m           = "EXTERNAL"
      [32m+[0m [0m[1m[0mname[0m[0m                            = "portfolio"
      [32m+[0m [0m[1m[0mport_name[0m[0m                       = "http"
      [32m+[0m [0m[1m[0mproject[0m[0m                         = "data-visitor-334805"
      [32m+[0m [0m[1m[0mprotocol[0m[0m                        = "HTTP"
      [32m+[0m [0m[1m[0mself_link[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0msession_affinity[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mtimeout_sec[0m[0m                     = 30

      [32m+[0m [0mbackend {
          [32m+[0m [0m[1m[0mbalancing_mode[0m[0m               = "UTILIZATION"
          [32m+[0m [0m[1m[0mcapacity_scaler[0m[0m              = 1
          [32m+[0m [0m[1m[0mgroup[0m[0m                        = "projects/data-visitor-334805/regions/us-central1/networkEndpointGroups/portfolio"
          [32m+[0m [0m[1m[0mmax_connections[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_endpoint[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_connections_per_instance[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_endpoint[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_rate_per_instance[0m[0m        = (known after apply)
          [32m+[0m [0m[1m[0mmax_utilization[0m[0m              = (known after apply)
        }

      [32m+[0m [0mcdn_policy {
          [32m+[0m [0m[1m[0mcache_mode[0m[0m                   = "CACHE_ALL_STATIC"
          [32m+[0m [0m[1m[0mclient_ttl[0m[0m                   = 7200
          [32m+[0m [0m[1m[0mdefault_ttl[0m[0m                  = 3600
          [32m+[0m [0m[1m[0mmax_ttl[0m[0m                      = 10800
          [32m+[0m [0m[1m[0mnegative_caching[0m[0m             = true
          [32m+[0m [0m[1m[0mserve_while_stale[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msigned_url_cache_max_age_sec[0m[0m = 7200
        }

      [32m+[0m [0mlog_config {
          [32m+[0m [0m[1m[0menable[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0msample_rate[0m[0m = (known after apply)
        }
    }

[1m  # google_compute_global_forwarding_rule.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_global_forwarding_rule" "portfolio" {
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mip_address[0m[0m            = "34.117.171.161"
      [32m+[0m [0m[1m[0mip_protocol[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mload_balancing_scheme[0m[0m = "EXTERNAL"
      [32m+[0m [0m[1m[0mname[0m[0m                  = "portfolio"
      [32m+[0m [0m[1m[0mport_range[0m[0m            = "443"
      [32m+[0m [0m[1m[0mproject[0m[0m               = "data-visitor-334805"
      [32m+[0m [0m[1m[0mself_link[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mtarget[0m[0m                = (known after apply)
    }

[1m  # google_compute_managed_ssl_certificate.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_managed_ssl_certificate" "portfolio" {
      [32m+[0m [0m[1m[0mcertificate_id[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mexpire_time[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                      = "portfolio"
      [32m+[0m [0m[1m[0mproject[0m[0m                   = "data-visitor-334805"
      [32m+[0m [0m[1m[0mself_link[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0msubject_alternative_names[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m                      = "MANAGED"

      [32m+[0m [0mmanaged {
          [32m+[0m [0m[1m[0mdomains[0m[0m = [
              [32m+[0m [0m"piper.codes",
            ]
        }
    }

[1m  # google_compute_target_https_proxy.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_target_https_proxy" "portfolio" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "portfolio"
      [32m+[0m [0m[1m[0mproject[0m[0m            = "data-visitor-334805"
      [32m+[0m [0m[1m[0mproxy_bind[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mproxy_id[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mquic_override[0m[0m      = "NONE"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mssl_certificates[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0murl_map[0m[0m            = (known after apply)
    }

[1m  # google_compute_url_map.portfolio[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "google_compute_url_map" "portfolio" {
      [32m+[0m [0m[1m[0mcreation_timestamp[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mdefault_service[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mfingerprint[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mmap_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m               = "portfolio"
      [32m+[0m [0m[1m[0mproject[0m[0m            = "data-visitor-334805"
      [32m+[0m [0m[1m[0mself_link[0m[0m          = (known after apply)
    }

[0m[1mPlan:[0m 5 to add, 1 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @doughepi, Action: `pull_request`*